Информационная_база/src/Catalogs/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтавкиНДС</name>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеОблагается</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расчетная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтавкиНДС</name>
    <type>
      <types>EnumRef.ВидыСтавокНДС</types>
    </type>
  </attributes>
</mdclass:Catalog>

Информационная_база/src/Catalogs/СтавкиНДС/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	Если Не ЗначениеЗаполнено(ВидСтавкиНДС) И Не ДополнительныеСвойства.Свойство("ОбновлениеВидовСтавокНДС") Тогда
		ВидСтавкиНДС =  Перечисления.ВидыСтавокНДС.ВидСтавки(
			Новый Структура("Ставка,НеОблагается,Расчетная", Ставка, НеОблагается, Расчетная));
	КонецЕсли;
	
	// Не выполнять дальнейшие действия при обмене данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
